;
; If you have translated the new language file, you can send it to aqiayi@sina.com .
; Добро пожаловать на сайт Baymax Patch toOls: https://github.com/sicaril/Baymax-Patch-toOls
; Если вы обнаружите, что некоторые переведенные записи нуждаются в исправлении, вы можете обновить их на github или написать мне.

[Info]
;Language name in your own language e.g. Deutsch
LanguageVer = 1.0
Language = Русский
CountriesOrRegions = Россия
LangId = 0419
Translator = DeepL

;Note to translators:
;Please keep escape sequences like $1, $2, \n, \t, %d, %s, %% unchanged

[BaymaxUi]
; Main UI
1000 = Информация
1001 = Целевая программа:
1002 = Название взломщика:
1003 = Название взломщика:
1004 = Данные
1005 = Тип патча:
1006 = Добавить
1007 = Просмотреть
1008 = Удалить
1009 = Порядковый
1010 = Тип патча
1011 = Имя модуля
1012 = Данные патча
1013 = Создать патч

; Меню
1100 = Проект(&P)
1101 = Инструменты(&T)
1102 = Опции(&O)
1103 = Помощь(&H)

; Меню Sub0
1110 = Новый проект патча(&N)
1111 = Загрузить проект патча(&L)
1112 = Сохранить проект патча(&S)
1113 = Создать Hijack-патч(&U)
1114 = Создать инъекционный патч(&I)
1115 = Создать отладочный патч Hijack (&D)
1116 = Создать отладочную заплатку Inject(&P)
1117 = Выход(&X)

; Меню Sub2
1130 = Защитить аппаратные точки останова(&P)
1131 = Не прерывать в OEP(&O)
1132 = Патч содержит недопустимую запись(&U)
1133 = Максимум 5 поисков недопустимых записей(&F)
1134 = Пользовательский тайминг DLL патча(&M)
1135 = Режим программных точек останова(&I)
1136 = Имитация одношагового режима (однопоточный)
1137 = Имитация одношагового режима II(однопоточный)
1138 = Имитация режима HOOK (поддержка многопоточности)
1139 = Режим аппаратной точки останова(&B)
1140 = Установить на текущий поток (другие потоки не устанавливают точку останова)
1141 = Установить на всех потоках (установить аппаратные точки останова на всех потоках)
1142 = Режим загрузчика(&L)
1143 = Загрузка основного потока APC(перед Oep)
1144 = Автоматическая загрузка(при запуске до Oep)
1145 = Запуск патча без заставки(&S)
1146 = Язык

; Sub3 Menu
1150 = Справочный документ(&H)
1151 = Просмотр обновления(&U) 
1152 = Отправить звезду Github(&S)
1153 = О программе (&A)

; Всплывающее меню
1160 = Просмотр элемента
1161 = Удалить элемент

; ТЕКСТ
1200 = Baymax64 Советы
1201 = Заплатка для угона64.exe
1202 = Отладочная версия захвата патча64.exe
1203 = Инъекция пластыря64.exe
1204 = Отладка инъекции патча64.exe
1205 = Baymax Советы
1206 = Заплатка для угона.exe
1207 = Отладочная версия захвата патча.exe
1208 = Инъекция пластыря.exe
1209 = Отладка инъекции патча.exe

1210 = Не удалось загрузить проект патча! если проект патча имеет более раннюю версию, используйте последнюю версию для загрузки патча.
1211 = Данные патча не найдены!
1212 = EXE-файл (*.exe)\0*.exe\0
1213 = Новый проект
1214 = Нужно ли сохранить текущий проект?
1215 = Нужно ли сохранить проект патча перед выходом?
1216 = Baymax Disclaimer
1217 = Этот инструмент предназначен только для технического общения, не используйте в коммерческих или незаконных целях! \r\n Все эффекты, вызванные созданным вами патч-файлом, не имеют никакого отношения к автору этого патч-инструмента Baymax! \r\n\r\n Когда вы нажимаете OK, вы соглашаетесь с условиями.
1218 = Этот патч предназначен только для технического изучения, \r\n пожалуйста, удалите его в течение 24 часов после загрузки! \r\n Если вам нравится эта программа, пожалуйста, зарегистрируйтесь для покупки.
1219 = Документ справки не существует, пожалуйста, скачайте последнюю версию с официального сайта.
1220 = Не удалось открыть документ справки. Пожалуйста, откройте файл "Help.pdf" из каталога программы.
1221 = Добавить патч
1222 = Создать патч
1223 = Пожалуйста, сначала установите целевую программу!
1224 = Файл патча создан успешно!
1225 = Не удалось создать патч-файл!
1226 = Программа повреждена, пожалуйста, скачайте последнюю версию с официального сайта!
1227 = Эта запись содержит сохраненные данные и на нее ссылается другая запись. Пожалуйста, сделайте ссылку перед удалением.
1228 = EXE-файл (*.exe)\0
1229 = BPT файл (*.bpt)\0*.bpt\0
1230 = BPT файл (*.bpt)\0
1231 = Этот проект содержит %d записей патча. Нужно ли вам переустановить целевую программу?
1232 = Нужно ли сохранить текущий проект перед загрузкой нового проекта?
1233 = Вы уверены, что хотите удалить запись патча?

[FeatureCodeUi]
; PlugIn Name
666 = Поиск и замена патча

; Главный пользовательский интерфейс
1000 = Патч поиска и замены
1001 = Файл
1002 = Процесс:
1003 = Модуль:
1004 = Целью является любой процесс
1005 = Цель - другой модуль
1006 = Патч после декодирования
1007 = Данные патча должны быть декодированы программой для вынесения решения
1008 = Набор
1009 = Адрес патча
1010 = Виртуальный адрес:
1011 = Адрес модуля:
1012 = Файл сравнения
1013 = Поиск кода характеристики: (Пожалуйста, заполните данные кода характеристики в исходных данных, поддержка '??')
1014 = Поиск кода характеристики
1015 = Функция экспорта:
1016 = Данные патча
1017 = Исходные данные:
1018 = Исходные данные:
1019 = Примечание:
1020 = Удалить
1021 = Редактировать
1022 = Добавить
1023 = Отменить
1024 = Сохранить
1025 = Смещение адреса (RVA)
1026 = Необработанные данные
1027 = Исправленные данные
1028 = Примечание

;HookUi
1100 = Время выполнения патча
1101 = Обработка не требуется
1102 = Режим Hook API
1103 = Выбрать модуль:
1104 = Экспортировать функцию:
1105 = Установить режим точки останова
1106 = Имя модуля:
1107 = Адрес точки останова(RVA):
1108 = Режим динамического адреса
1109 = Минимальное значение пространства, необходимого для размещения данных патча(HEX) :
1110 = Режим времени ожидания
1111 = Миллисекунды ожидания(DEC):
1112 = Опция крючка
1113 = OK
1114 = Отмена

;HookUi Text
1150 = Настройки крючка
1151 = Ошибка настройки крючка
1152 = Ошибка настройки модуля
1153 = Ошибка настройки API
1154 = Ошибка настройки значения RVA, пожалуйста, введите шестнадцатеричное значение заново.
1155 = Минимальное значение пробела установлено неправильно, пожалуйста, введите шестнадцатеричное значение заново.
1156 = Неправильно установлено значение миллисекунды ожидания, пожалуйста, введите десятичное значение заново.
1157 = EXE файл(*.exe)\0*.exe\0DLL файл(*.dll)\0*.dll\0PE файл(*.*)\0*.*\0

;FixItem Ui
1200 = Редактировать запись патча

;Msg Text
1300 = Настройки крючка
1301 = Данные патча не добавлены
1302 = Неправильное добавление данных
1303 = Исходные данные введены неверно
1304 = Неправильно введены данные патча
1305 = Неправильный адрес патча

1310 = Вы уверены, что хотите отменить опцию HOOK?
1311 = Данные патча не сохранены. Вы хотите закрыть окно патча?
1312 = Введенные данные неверны. Пожалуйста, проверьте их перед выполнением операций.
1313 = Адрес патча неверен! Неправильно введены данные относительного виртуального адреса (RVA).
1314 = Адрес патча неверен! Виртуальный адрес (VA) не может быть пустым. Пожалуйста, введите адрес патча (шестнадцатеричный).
1315 = Неверный адрес патча! Адрес модуля не может быть пустым. Пожалуйста, введите адрес, по которому модуль загружен в память (шестнадцатеричный).
1316 = Неверный адрес патча! Данные виртуального адреса (VA) неверны. Пожалуйста, введите шестнадцатеричные данные.
1317 = Адрес патча неверен! Данные адреса модуля неверны, пожалуйста, введите шестнадцатеричные данные.
1318 = Коммутационный адрес неверен! Виртуальный адрес (VA) не может быть меньше или равен адресу модуля и не может быть меньше или равен нулю.
1319 = Введенные данные должны быть шестнадцатеричным значением (используйте символ '??' для подстановочных знаков).
1320 = Шестнадцатеричные данные должны содержать четное количество символов.
1321 = Необработанные данные не могут быть пустыми.
1322 = Данные патча не могут быть пустыми.
1323 = Формат исходных данных неверен. Это должно быть шестнадцатеричное значение.
1324 = Формат данных патча неверен. Это должно быть шестнадцатеричное значение.
1325 = Длина исходных данных не совпадает с длиной данных патча.
1326 = Исходные данные неверны: введенные данные должны быть шестнадцатеричным значением (Используйте символ '??' для подстановочных знаков). 
1327 = Данные патча неверны: введенные данные должны быть шестнадцатеричным значением (используйте символ '??' для подстановочных знаков). 
1328 = Не удалось загрузить функциональный модуль!
1329 = Не удалось получить данные патча!
1330 = Исходные данные совпадают с данными патча. Пожалуйста, проверьте данные перед добавлением.

1350 = Не устанавливайте флажок "Target other modules"!
1351 = EXE файл (*.exe)\0*.exe\0
1352 = DLL файл (*.*)\0*.*\0

; PE Check
2000 = Файл не существует или не удалось загрузить
2001 = Это не действительный PE файл
2002 = Это недействительный 32-битный PE-файл
2003 = Это недопустимый 32-битный Dll-файл
2004 = Это недопустимый 32-битный EXE-файл
2005 = Это недействительный 64-битный PE-файл
2006 = Это недопустимый 64-битный Dll-файл
2007 = Это недействительный 64-битный EXE-файл


[BreakPointCodeUi]
; PlugIn Name
666 = Исключение точки останова

; Главный пользовательский интерфейс
1000 = Патч точки останова исключения
1001 = Файл
1002 = Процесс:
1003 = Модуль:
1004 = Цель - любой процесс
1005 = Цель - другой модуль
1006 = Патч после декодирования
1007 = Данные патча должны быть декодированы программой для вынесения решения
1008 = Установить

1009 = Адрес точки останова
1010 = Виртуальный адрес:
1011 = Адрес модуля:
1012 = Первый байт:
1013 = Данные кода характеристики:
1014 = Поиск кода характеристики
1015 = Смещение:
1016 = Функция экспорта:
1017 = Смещение:
1018 = Изменить возвращаемое значение:
1019 = Смещение стека Return Addr:
1020 = Корректировка стека: 

1021 = Данные патча
1022 = Тип патча:
1023 = Регистр флага:
1024 = Регистр:
1025 = Смещение:
1026 = Изменить значение:
1027 = Тип значения:
1028 = Регистр:
1029 = Смещение:
1030 = Оператор
1031 = Имя переменной, в которой хранятся данные патча
1032 = Данные патча:
1033 = Примечание:
1034 = Частота:
1035 = Тип:
1036 = Условные точки останова
1037 = Удалить
1038 = Редактировать
1039 = Добавить
1040 = Отменить
1041 = Сохранить
1042 = Примечание: Введенные данные представлены в шестнадцатеричном формате

1043 = Адрес смещения(RVA)
1044 = Необработанные данные
1045 = Патч-данные
1046 = Примечание

; HookUi
1100 = Время выполнения патча
1101 = Обработка не требуется
1102 = Режим Hook API
1103 = Выбрать модуль:
1104 = Экспортировать функцию:
1105 = Установить режим точки останова
1106 = Имя модуля:
1107 = Адрес точки останова(RVA):
1108 = Режим динамического адреса
1109 = Минимальное значение пространства, необходимого для размещения данных патча(HEX) :
1110 = Режим времени ожидания
1111 = Миллисекунды ожидания(DEC):
1112 = Опция крючка
1113 = OK
1114 = Отмена

;HookUi Text
1150 = Настройки крючка
1151 = Ошибка настройки крюка
1152 = Ошибка настройки модуля
1153 = Ошибка настройки API
1154 = Ошибка настройки значения RVA, пожалуйста, введите шестнадцатеричное значение заново.
1155 = Минимальное значение пробела установлено неправильно, пожалуйста, введите шестнадцатеричное значение заново.
1156 = Неправильно установлено значение миллисекунды ожидания, пожалуйста, введите десятичное значение заново.
1157 = EXE файл(*.exe)\0*.exe\0DLL файл(*.dll)\0*.dll\0PE файл(*.*)\0*.*\0

; FixItemDlg UI
1200 = Редактировать запись патча
1201 = Отменить
1202 = Сохранить

1210 = Данные патча:
1211 = Смещение EIP:
1212 = Смещение RIP:
1213 = HEX кода:
1214 = Метка хранилища:
1215 = Значение регистра:
1216 = Описание:
1217 = Данные метки:
1218 = Тайм-аут обнаружения:
1219 = Изменить значение:
1220 = Хранимое значение:
1221 = Данные, которые вы получаете:

; MemOffsetDlg Ui
1300 = Адрес цели (данные смещения представлены в шестнадцатеричном формате)
1301 = Регистр адресации:
1302 = Память, на которую указывает регистр:
1303 = Пример: [ESP+24]+3C. Когда регистр адресации имеет значение EXX/RXX, он указывает на сохраненный адрес
1304 = Преобразование
1305 = ОК

1310 = Разрешение формата
1311 = Ошибка данных, регистр не найден.
1312 = Ошибка данных, тип регистра неправильный.
1313 = Ошибка данных, неверное значение смещения.
1314 = Ошибка данных, символы [] не совпадают.
1315 = Ошибка данных, избыточный синтаксический анализ строки.
1316 = Ошибка данных, ошибка синтаксического анализа.
1317 = Ошибка данных, неверное совпадение l-значения.
1318 = Ошибка данных, в значении смещения отсутствует знак.

;ConditionDlg Ui
1400 = Условные точки останова
1401 = Частота:
1402 = Параметры условия
1403 = Не использовать условные точки останова.
1404 = Количество раз выполнения точек останова:
1405 = Тип точек останова:
1406 = Регистр:
1407 = Смещение:
1408 = Тип данных:
1409 = Условие:
1410 = Значение:
1411 = Пользовательская условная точка останова:
1412 = Отмена
1413 = OK

; MsgText
1500 = Установите тип точек останова
1501 = Пожалуйста, установите тип регистра
1502 = Пожалуйста, установите тип данных
1503 = Пожалуйста, установите тип условия
1504 = Значение, введенное в поле смещения, неверно. Пожалуйста, проверьте и измените его.
1505 = Введенные в поле значения неверные данные, проверьте и измените их.

1510 = Настройки HOOK
1511 = Данные патча не добавлены
1512 = Неправильное добавление данных
1513 = Неправильный ввод данных кода функции
1514 = Неправильный ввод данных патча
1515 = Неправильно введен адрес RVA
1516 = Дружеское напоминание
1517 = Редактировать запись о патче

1520 = Вы уверены, что хотите отменить опцию Hook?
1521 = Данные патча не сохранены. Вы хотите закрыть текущее окно напрямую?
1522 = Введенные вами данные неверны. Пожалуйста, проверьте их перед началом работы.
1523 = Адрес патча неверен! Неправильно введены данные относительного виртуального адреса (RVA).
1524 = Адрес патча неверен! Виртуальный адрес (VA) не может быть пустым. Пожалуйста, введите адрес патча (шестнадцатеричный).
1525 = Неверный адрес коммутации! Базовый адрес модуля не может быть пустым. Пожалуйста, введите адрес, по которому модуль загружен в память (шестнадцатеричный).
1526 = Неверный адрес патча! Данные виртуального адреса неверны. Пожалуйста, введите шестнадцатеричные данные.
1527 = Адрес патча неверен! Данные адреса модуля неверны, пожалуйста, введите шестнадцатеричные данные.
1528 = Коммутационный адрес неверен! Виртуальный адрес (VA) не может быть меньше или равен адресу модуля и не может быть меньше или равен нулю.
1529 = Введенные данные должны быть шестнадцатеричным значением (используйте символ '??' для подстановочных знаков).
1530 = Шестнадцатеричные данные должны содержать четное количество символов.
1531 = Необработанные данные или данные патча не могут быть пустыми.
1532 = Формат Raw-данных неверен. Это должно быть шестнадцатеричное значение.
1533 = Формат данных патча неверен. Это должно быть шестнадцатеричное значение.
1534 = Длина Raw-данных не соответствует данным патча.
1535 = Значение смещения данных кода признака неверно. Это должно быть шестнадцатеричное значение.
1536 = Первый байт адреса патча неверен. Заполните шестнадцатеричное значение байта. Если целевой модуль не упакован, введите 0.
1537 = Целевой модуль может быть упакован или данные, на которые указывает RVA, должны быть декодированы, необходимо ввести первый байт адреса патча.
1538 = Значение RVA целевого модуля отличается от значения первого байта входа, пожалуйста, обратите внимание, что модуль предположительно упакован или должен быть декодирован после выполнения.
1539 = Неправильно установлен элемент данных патча.
1540 = Неправильно введены данные патча.
1541 = Неправильно введено значение смещения функции.
1542 = Неправильно указано смещение стека адреса возврата функции, должно быть выравнивание по байтам DWORD или QWORD.
1543 = Ключевое слово в Ini файле не может быть пустым и имеет минимальную длину в один символ.
1544 = Адрес патча неверен! Формат значения кода функции следующий: AA BB ?? 
1545 = Значение выравнивания стека адреса возврата функции неверно, должно быть выравнивание по байтам DWORD или QWORD.
1546 = Пожалуйста, сначала выберите соответствующий регистр.
1547 = Метка хранения типа данных, соответствующего данным патча, не найдена. Пожалуйста, сохраните метку перед использованием.
1548 = Текущая метка хранения используется. Пожалуйста, используйте другую метку хранения.
1549 = Регистр флагов пуст, пожалуйста, выберите сначала соответствующий регистр.
1550 = Регистр пуст. Пожалуйста, выберите сначала соответствующий регистр.
1551 = Тип модифицированного значения пуст. Выберите сначала соответствующий модифицированный тип значения.
1552 = Тип значения пуст. Выберите сначала соответствующий тип значения.
1553 = Значение регистра введено неверно.
1554 = Неправильно задано смещение регистра.
1555 = Неправильно задано смещение EIP/RIP.
1556 = Неправильно задана длина Hex. Введите длину HEX данных патча (длина Hex - шестнадцатеричная).
1557 = Текущая метка хранилища неверна. символы метки хранилища разрешены только буквы, цифры и знаки подчеркивания.
1558 = Метка данных патча, считанных из .ini, неверна, символы метки хранилища допускают только буквы, цифры и знаки подчеркивания.
1559 = Загрузка функционального модуля не удалась!
1560 = Эта запись содержит метку хранения %s. Вы хотите удалить ее?
1561 = Вы удалили запись, содержащую метку хранения %s. Пожалуйста, измените метку, если она используется в другом месте.
1562 = Метка хранения неверна, метка хранения имеет неадресный тип или не существует!
1563 = Элемент патча содержит переменные хранения и используется другими элементами. Пожалуйста, не используйте их перед модификацией.
1564 = Когда значение смещения EIP/RIP заполнено NOP(или 0), модуль исправления автоматически получит длину инструкции ассемблера по адресу точки останова и добавит EIP/RIP для достижения эффекта пропуска этой инструкции ассемблера. \r\nКогда значение смещения не NOP(или 0), значение смещения EIP/RIP вычисляется как целевой адрес минус текущий адрес (пожалуйста, введите шестнадцатеричное значение).
1565 = Изменить описание EIP/RIP
1566 = Больше не отображается
1567 = OK

1570 = Не удалось проанализировать запись патча!
1571 = Снимите флажок "Целевые другие модули"!
1572 = Данные патча все еще не добавлены. Вы хотите закрыть текущее окно напрямую?
1573 = Данные патча не добавлены
1574 = Если выбрано "Сохранить текущий контекст и изменить его при возвращении функции", можно выбрать только тип патча "Изменить память, на которую указывает регистр"!
1575 = EXE файл (*.exe)\0*.exe\0
1576 = DLL файл (*.*)\0*.*\0

; ListCombo
1600 = Модифицировать регистр
1601 = Модифицировать регистр флага
1602 = Модифицировать память, на которую указывает регистр
1603 = Модифицировать EIP/RIP
1604 = Модификатор ключа памяти
1605 = Сохраняет адрес в инструкции ассемблера
1606 = Модифицировать память, на которую указывает адрес хранения
1607 = Добавить антиотладочное обнаружение
1608 = Модифицировать значение регистра MMX

1610 = Пользовательский непосредственный номер
1611 = Текущий регистр
1612 = Память, на которую указывает регистр
1613 = Использовать сохраненные данные

1620 = Добавить соединитель
1621 = Добавить значение регистра
1622 = Добавить значение памяти, на которую указывает регистр
1623 = Использовать сохраненные данные
1624 = всплывающее окно отображает информацию о записи

1630 = Сохранить регистр
1631 = Сохранить память, на которую указывает регистр
1632 = Сохранить адрес памяти в инструкции ассемблера

1640 = Регистр
1641 = Память, на которую указывает регистр

1650 = равно(==)
1651 = неравенство(!=)

1660 = равно(==)
1661 = неравно(!=)
1662 = больше чем(>)
1663 = больше или равно(>=)
1664 = меньше чем(<)
1665 = Меньше или равно(<=)
1666 = подписано больше чем(>)
1667 = подписано больше или равно(>=)
1668 = подписано меньше чем(<)
1669 = подписано меньше или равно(<=)

1670 = BYTE
1671 = WORD
1672 = DWORD
1673 = HEX числов
1674 = ASCII Строка
1675 = Delphi Строка
1676 = Unicode Строка
1677 = ASCII длин
1678 = Delphi длин
1679 = Unicode длин
1680 = QWORD

1690 = BYTE
1691 = WORD
1692 = DWORD
1693 = HEX числов
1694 = ASCII Строка
1695 = Delphi Строка
1696 = Unicode Строка
1697 = QWORD

1700 = BYTE
1701 = BYTE(decimal)
1702 = WORD
1703 = WORD(decimal)
1704 = DWORD
1705 = DWORD(decimal)
1706 = DWORD(signed)
1707 = QWORD
1708 = QWORD(decimal)
1709 = QWORD(signed)

1710 = BYTE
1711 = BYTE(decimal)
1712 = WORD
1713 = WORD(decimal)
1714 = DWORD
1715 = DWORD(decimal)
1716 = DWORD(signed)
1717 = HEX числов
1718 = ASCII Строка
1719 = Delhpi Строка
1720 = Unicode Строка
1721 = QWORD
1722 = QWORD(decimal)
1723 = QWORD(signed)

1730 = no participation
1731 = AND
1732 = OR
1733 = XOR
1734 = NOT
1735 = SHL(Logical Left Shift)
1736 = ROL(Loop Left Shift)
1737 = SHR(Logical Right Shift)
1738 = ROR(Loop Right Shift)
1739 = SAR(Shift Arithmetic Right)
1740 = ADD
1741 = SUB
1742 = MUL
1743 = DIV
1744 = MOD

1750 = Один раз
1751 = Каждый раз

1760 = Интеллектуальная точка останова
1761 = Программная точка останова(int3)
1762 = Аппаратная точка останова

1770 = Сохранить текущий контекст и изменить его при возврате функции
1771 = Изменить контекст при возврате функции
1772 = Функция возвращается непосредственно после модификации контекста

; Проверка PE
2000 = Файл не существует или не удалось загрузить
2001 = Это недопустимый PE-файл
2002 = Это недопустимый 32-битный PE-файл
2003 = Это недопустимый 32-битный Dll-файл
2004 = Это недопустимый 32-битный EXE-файл
2005 = Это недействительный 64-битный PE-файл
2006 = Это недопустимый 64-битный Dll-файл
2007 = Это недействительный 64-битный EXE-файл


[ComparePeUi]
; PlugIn Name
666 = Сравнение файлов PE

; MainUI
1000 = Сравнение файлов PE
1001 = Оригинальный файл:
1002 = Изменить файл:
1003 = Сброс базового адреса (HEX) :
1004 = Выбрать все
1005 = Найти разницу в 0, всего 0 байт.
1006 = Добавить выбранное
1007 = Сравнить файл

1010 = Относительный виртуальный адрес:
1011 = Виртуальный адрес:
1012 = Адрес смещения файла:
1013 = Необработанные данные:
1014 = Модифицировать данные:
1015 = Информация об элементе

1020 = Относительный виртуальный адрес
1021 = Виртуальный адрес
1022 = Адрес смещения файла
1023 = Необработанные данные
1024 = Изменить данные
1025 = Информация о разделе

1030 = Файл сравнения добавлен автоматически
1031 = Не удалось открыть исходный файл!
1032 = Не удалось открыть файл модификации!
1033 = Сравнение файлов не удалось, неизвестная ошибка!
1034 = Тип исходного файла и изменяемого файла отличается, не сравнивать!
1035 = Размер исходного файла и файла модификации отличается, не сравнивать!
1036 = Ошибка ввода данных базового адреса, проверьте и повторите сравнение!
1037 = Ошибка ввода данных базового адреса, превышен максимальный размер PE-файла!
1038 = Если исходный файл несовместим с файлом проекта, не добавляйте его.
1039 = Сравните данные перед добавлением.
1040 = Найдено %d различий, всего %d байт.
1041 = EXE файлы (*.EXE)\0*.EXE\0DLL файлы (*.DLL)\0*.DLL\0PE файлы (*.*)\0*.*\0

; Проверка PE
2000 = Файл не существует или не удалось загрузить
2001 = Это не действительный PE файл
2002 = Это недействительный 32-битный PE-файл
2003 = Это недопустимый 32-битный Dll-файл
2004 = Это недопустимый 32-битный EXE-файл
2005 = Это недействительный 64-битный PE-файл
2006 = Это недопустимый 64-битный Dll-файл
2007 = Это недействительный 64-битный EXE-файл


[OffsetTransformUi]
; PlugIn Name
666 = Преобразование формата адреса

; MainUI
1000 = Преобразование формата адреса
1001 = Целевой файл:
1002 = Информация о сегменте
1003 = Преобразование формата
1004 = Тип:
1005 = Базовый адрес:
1006 = Конвертировать
1007 = Размер файла:
1008 = Размер зеркала:

1010 = Относительный виртуальный адрес
1011 = Виртуальный адрес
1012 = Адрес смещения файла
1013 = Необработанный байт
1014 = Информация о разделе

1020 = Информация о разделе
1021 = Виртуальный адрес
1022 = Виртуальный размер
1023 = Смещение необработанных данных
1024 = Размер данных
1025 = Флаги

1030 = Значение %s введено неверно, проверьте и введите заново!
1031 = Введен неверный относительный виртуальный адрес, превышен SizeOfImage!
1032 = Введен неверный виртуальный адрес, он должен быть больше или равен ImageBase и меньше размера памяти модуля!
1033 = Ввод адреса смещения файла неверен, превышен размер файла!
1034 = Адрес смещения файла превышает размер файла, не находится в файле!
1035 = Неправильно введен базовый адрес, превышен максимальный размер PE файла!
1036 = Базовый адрес введен неверно, проверьте и сравните еще раз!
1037 = Не удалось открыть исходный файл!
1038 = EXE файлы (*.EXE)\0*.EXE\0DLL файлы (*.DLL)\0*.DLL\0PE файлы (*.*)\0*.*\0

; Проверка PE
2000 = Файл не существует или не удалось загрузить
2001 = Это не действительный PE файл
2002 = Это недействительный 32-битный PE-файл
2003 = Это недопустимый 32-битный Dll-файл
2004 = Это недопустимый 32-битный EXE-файл
2005 = Это недействительный 64-битный PE-файл
2006 = Это недопустимый 64-битный Dll-файл
2007 = Это недействительный 64-битный EXE-файл


[SearchFeatureUi]
; PlugIn Name
666 = Поиск кода функции

; MainUI
1000 = Поиск кода функции
1001 = Целевой файл:
1002 = Код функции:
1003 = Сброс базового адреса (HEX):
1004 = Найти 0.
1005 = Поиск
1006 = Строка поиска

1010 = Нет.
1011 = Виртуальный адрес
1012 = Относительный виртуальный адрес
1013 = Адрес смещения файла
1014 = Информация о разделе
1015 = Флаги

1020 = Код функции не найден.
1021 = Всего найдено %d
1022 = Найдено более %d
1023 = EXE файлы (*.EXE)\0*.EXE\0DLL файлы (*.DLL)\0*.DLL\0PE файлы (*.*)\0*.*\0
1024 = Данные кода признака должны быть шестнадцатеричным значением (поддержка '??').
1025 = Длина кода признака должна быть четной.
1026 = Формат кода признака неверен! \r\n формат: AA BB ?? ?? CC
1027 = Целевой файл пуст. Пожалуйста, сначала выберите целевой файл.
1028 = Не удалось открыть целевой файл!
1029 = Код функции не найден!
1030 = Базовый адрес введен неверно, превышен максимальный размер PE-файла!
1031 = Базовый адрес введен неверно, проверьте и сравните еще раз!
1033 = Пожалуйста, введите код функции!

1040 = Успешное копирование виртуального адреса!
1041 = Не удалось скопировать виртуальный адрес!
1042 = Успешное копирование относительного виртуального адреса!
1043 = Не удалось скопировать относительный виртуальный адрес!
1044 = Успешное копирование адреса смещения файла!
1045 = Не удалось скопировать адрес смещения файла!

1050 = Копирование виртуального адреса (VA)
1051 = Копирование относительного виртуального адреса(RVA)
1052 = Скопировать адрес смещения файла(FOA)

; Проверка PE
2000 = Файл не существует или не удалось загрузить
2001 = Это не действительный PE файл
2002 = Это недействительный 32-битный PE-файл
2003 = Это недопустимый 32-битный Dll-файл
2004 = Это недопустимый 32-битный EXE-файл
2005 = Это недействительный 64-битный PE-файл
2006 = Это недопустимый 64-битный Dll-файл
2007 = Это недействительный 64-битный EXE-файл


[StringToHexUi]
; PlugIn Name
666 = Строка в шестнадцатеричную систему счисления

; MainUI
1000 = Перевести строку в шестнадцатеричную систему
1001 = Строковые данные:
1002 = Шестнадцатеричные данные (слева направо в порядке следования строк, большой эндиан) :
1003 = Преобразование
1004 = Преобразование строки не удалось, возможно, потому что данные слишком длинные.


[PatchUi]
1000 = Программа:
1001 = Взломщик:
1002 = Дата:
1003 = Патч
1004 = Выбрать релиз

1010 = Пользовательский файл релиза
1011 = Порядковый номер
1012 = Имя модуля
1013 = Тип
1014 = модуль взлома
1015 = модуль взлома
1016 = Выбрать все
1017 = Релиз
1018 = сторонний модуль
1019 = О

1020 = Инъекция не удалась! Код ошибки: %d.
1021 = Smart select patch dll timeout, Программа может быть запущена или не нашла доступную hijack dll, Включить режим Inject? \r\n\r\n Дружеское напоминание: Если программа упакована, рекомендуется провести тестирование после освобождения всех файлов вручную. \r\n
1022 = Не удалось создать файл! Файл занят каким-то процессом. Пожалуйста, закройте этот процесс перед установкой патча. \r\nПуть к файлу: %s
1023 = Не удалось создать файл! Код ошибки: %d. \r\nПуть к файлу: %s
1024 = Не удалось записать в файл! Код ошибки: %d \r\nПуть к файлу: %s
1025 = Заплатка успешна!
1026 = Не удалось освободить файл!
1027 = %d файлов освобождены успешно!
1028 = Файл уже существует. Переписать его? \r\n Целевой файл: %s

